In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Excel_data.xlsx")

In [3]:
print(df)

      ID      Name   Age         Profession  Salary
0      1    Olivia  23.0            Teacher  184518
1      2    Sophia  20.0              Boxer  119572
2      3      Jake  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [4]:
df.to_excel("xyz.xlsx")

In [5]:
df_csv = pd.read_csv("CSV_data.csv")

In [6]:
df_csv.to_csv("abc.csv")

In [8]:
df.head(10)

   ID    Name   Age Profession  Salary
0   1  Olivia  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920
5   4   Rocky  56.0       Chef  117920
6   4   Rocky  56.0       Chef  117920
7   4   Rocky  56.0       Chef  117920
8   4   Rocky  56.0       Chef  117920
9   4   Rocky  56.0       Chef  117920

In [11]:
df.tail(15)

      ID      Name   Age         Profession  Salary
485  486  Mr. Bean  59.0              Pilot  196562
486  487  Mr. Bean  23.0             Doctor  193209
487  488  Sherlock  49.0              Pilot   82386
488  489      Emma  21.0  Software Engineer   92013
489  490      John  56.0          Scientist   41192
490  491      John  57.0              Pilot  154180
491  492      Emma  34.0             Artist  145412
492  493      John  55.0             Artist   57720
493  494    Sophia  39.0             Doctor  174500
494  495     Rocky  27.0             Doctor   46975
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

In [12]:
df['Name']

0        Olivia
1        Sophia
2          Jake
3         Rocky
4         Rocky
         ...
495        John
496    Sherlock
497    Sherlock
498      Olivia
499    Sherlock
Name: Name, Length: 500, dtype: object

In [13]:
df.Name

0        Olivia
1        Sophia
2          Jake
3         Rocky
4         Rocky
         ...
495        John
496    Sherlock
497    Sherlock
498      Olivia
499    Sherlock
Name: Name, Length: 500, dtype: object

In [15]:
df[['ID','Salary']]

      ID  Salary
0      1  184518
1      2  119572
2      3  174897
3      4  117920
4      4  117920
..   ...     ...
495  496  137929
496  497   39870
497  498  165951
498  499  192618
499  500  194886

[500 rows x 2 columns]

In [17]:
# what is the difference between loc & iloc
df.head()

   ID    Name   Age Profession  Salary
0   1  Olivia  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920

In [18]:
df.loc[1:5, "Name" : "Profession"]

     Name   Age Profession
1  Sophia  20.0      Boxer
2    Jake  38.0  Scientist
3   Rocky  56.0       Chef
4   Rocky  56.0       Chef
5   Rocky  56.0       Chef

In [19]:
df.iloc[1:5, 1:4]

     Name   Age Profession
1  Sophia  20.0      Boxer
2    Jake  38.0  Scientist
3   Rocky  56.0       Chef
4   Rocky  56.0       Chef

In [20]:
df.iloc[2:5, [0,3]]

   ID Profession
2   3  Scientist
3   4       Chef
4   4       Chef

In [21]:
df.set_index("ID", inplace=True)
df.head()

      Name   Age Profession  Salary
ID
1   Olivia  23.0    Teacher  184518
2   Sophia  20.0      Boxer  119572
3     Jake  38.0  Scientist  174897
4    Rocky  56.0       Chef  117920
4    Rocky  56.0       Chef  117920

In [22]:
df.reset_index(inplace=True)

In [23]:
df.head()

   ID    Name   Age Profession  Salary
0   1  Olivia  23.0    Teacher  184518
1   2  Sophia  20.0      Boxer  119572
2   3    Jake  38.0  Scientist  174897
3   4   Rocky  56.0       Chef  117920
4   4   Rocky  56.0       Chef  117920

In [24]:
print(df)

      ID      Name   Age         Profession  Salary
0      1    Olivia  23.0            Teacher  184518
1      2    Sophia  20.0              Boxer  119572
2      3      Jake  38.0          Scientist  174897
3      4     Rocky  56.0               Chef  117920
4      4     Rocky  56.0               Chef  117920
..   ...       ...   ...                ...     ...
495  496      John  45.0              Boxer  137929
496  497  Sherlock  46.0              Boxer   39870
497  498  Sherlock  47.0          Detective  165951
498  499    Olivia  55.0           Comedian  192618
499  500  Sherlock  59.0  Software Engineer  194886

[500 rows x 5 columns]

In [25]:
df.shape

(500, 5)

In [26]:
df.dtypes

ID              int64
Name           object
Age           float64
Profession     object
Salary          int64
dtype: object

In [27]:
df['Name'] = df.Name.astype("string")

In [28]:
df.dtypes

ID                     int64
Name          string[python]
Age                  float64
Profession            object
Salary                 int64
dtype: object

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          500 non-null    int64
 1   Name        500 non-null    string
 2   Age         492 non-null    float64
 3   Profession  500 non-null    object
 4   Salary      500 non-null    int64
dtypes: float64(1), int64(2), object(1), string(1)
memory usage: 19.7+ KB

In [31]:
df.dtypes

ID                     int64
Name          string[python]
Age                  float64
Profession            object
Salary                 int64
dtype: object

In [36]:
df.describe()

               ID         Age         Salary
count  500.000000  492.000000     500.000000
mean   250.458000   40.810976  115602.828000
std    144.552978   11.790553   49404.366846
min      1.000000   20.000000   30164.000000
25%    125.750000   31.000000   74964.750000
50%    250.500000   40.500000  117920.000000
75%    375.250000   51.000000  160579.500000
max    500.000000   60.000000  199529.000000

In [37]:
df.isnull()

        ID   Name    Age  Profession  Salary
0    False  False  False       False   False
1    False  False  False       False   False
2    False  False  False       False   False
3    False  False  False       False   False
4    False  False  False       False   False
..     ...    ...    ...         ...     ...
495  False  False  False       False   False
496  False  False  False       False   False
497  False  False  False       False   False
498  False  False  False       False   False
499  False  False  False       False   False

[500 rows x 5 columns]

In [38]:
df.isnull().sum()

ID            0
Name          0
Age           8
Profession    0
Salary        0
dtype: int64

In [39]:
df1 = df.copy()

In [40]:
df1 = df1.dropna()

In [41]:
df1.isnull().sum()

ID            0
Name          0
Age           0
Profession    0
Salary        0
dtype: int64

In [43]:
df1.shape

(492, 5)

In [44]:
df1.dtypes

ID                     int64
Name          string[python]
Age                  float64
Profession            object
Salary                 int64
dtype: object

In [45]:
df1['Age'] = df1['Age'].astype(int)

In [46]:
df1.dtypes

ID                     int64
Name          string[python]
Age                    int32
Profession            object
Salary                 int64
dtype: object

In [47]:
df2 = df.copy()

In [49]:
df2 = df2.dropna(axis = 1, how = "any")

In [50]:
df2.dtypes

ID                     int64
Name          string[python]
Profession            object
Salary                 int64
dtype: object